package com.liang.common.util.keyword;

import java.io.File;
import java.io.FileWriter;
import java.io.IOException;
import java.util.Random;

/**
 * 本方法可以生成一百万字的随机文章
 * @author neusoft
 *
 */
public class CreateArticalTest {

	static String word="乂别夬夺岧岺峣峯屿巘佛复悁惓爱愰采升标湲蒙—，玡珣珷阿埃哀蔼艾碍爱隘安按暗岸案昂盎敖傲奥八巴把霸白柏百败拜斑班般板版伴瓣半邦榜傍谤苞包褒剥薄保饱宝抱报暴豹杯碑悲卑北辈背倍备被本笨崩迸鼻比鄙笔彼碧毕毙闭必辟壁臂避陛鞭边编扁便变辨辩遍标表别濒兵冰柄丙秉饼炳病并玻波博勃伯帛渤泊捕卜哺不布步部怖猜裁材才财踩采彩蔡餐参残惨灿苍仓沧藏操曹草策侧册测层插茶查察差诧拆柴蝉谗缠产阐昌场尝常长肠厂敞畅唱倡超钞朝潮巢车撤澈臣辰尘晨忱沉陈撑称城橙成呈乘程澄诚承逞骋持池迟驰耻齿侈尺赤翅充冲虫崇宠抽酬畴踌愁筹丑臭初出厨躇锄除楚储矗触处川穿椽传船窗床创吹炊垂春淳纯蠢绰磁雌辞慈词此刺赐次聪匆从丛粗篡摧崔催脆粹翠村存寸措错达答打大戴带殆代袋待逮禇怠耽担丹单胆旦但惮淡诞弹当荡刀蹈倒岛导到稻悼道盗德得的灯登等邓堤低滴笛狄涤抵底地蒂第帝弟颠点典电店殿雕凋掉吊钓调跌蝶叠丁顶鼎定东冬董懂动栋侗冻洞抖斗豆都督毒犊独读睹杜肚度渡端短段断堆队对顿盾遁多夺朵惰堕峨鹅俄额娥恶厄饿恩而儿耳尔饵二贰发伐乏法藩帆番翻繁凡烦反返范犯饭泛坊芳方房防妨仿访放菲非飞肥匪吠废沸费芬氛分纷坟焚粉奋忿粪丰封枫峰锋风疯逢冯缝奉凤佛否夫敷扶拂幅符伏服浮福弗甫辅俯斧府腐赴副覆赋复傅付父腹负富附妇该改概盖溉干甘柑竿肝赶感敢刚纲皋高膏稿告歌鸽格阁隔个各给根耕更庚耿工攻功恭供公宫弓拱贡共钩勾沟苟狗垢沽孤姑鼓古骨谷故顾固刮瓜寡挂怪棺关官冠观管馆罐灌贯光广规归龟闺轨鬼癸桂贵郭国果裹过骸海亥害憨韩含涵寒函罕翰旱汗汉杭壕豪毫好号浩呵荷核禾和何合河赫褐鹤贺黑痕恨横衡恒烘虹鸿洪宏弘红侯吼厚候后呼乎忽瑚壶葫胡蝴狐湖虎户花华滑画化话徊怀淮坏欢环桓还缓换患唤焕涣宦幻荒黄簧皇煌恍灰挥辉徽回毁悔慧卉惠晦秽会讳诲荤昏婚魂浑混豁活伙火获或惑霍货祸击基机稽积肌饥迹激鸡姬绩吉极棘籍集及急疾汲即嫉几己技冀季祭济寄寂计记既忌际继纪嘉夹佳家加颊贾甲假稼架驾嫁监坚间兼肩缄检柬捡简剪减荐槛鉴贱见箭件健剑饯渐涧建将江疆桨讲匠降焦交郊浇骄嚼搅矫脚角剿教较揭接皆街阶截劫节杰竭洁结解戒藉界借介届巾斤金今津襟紧锦谨进靳晋禁近浸尽劲荆兢睛晶京惊精经井景静境敬镜径靖竟净究玖韭久九酒救旧就拘居菊局矩举聚巨具踞俱句炬剧倦眷卷绢抉掘爵觉决诀绝均菌军君峻俊浚郡骏开揩楷慨刊堪看康慷抗亢考苛柯棵颗科可渴克刻客肯坑空恐孔控口扣枯哭窟苦酷库夸跨胯块快宽款匡筐狂旷况亏窥葵奎傀馈愧溃坤昆困括廓阔莱来赖蓝篮阑兰揽览懒缆烂琅狼廊郎朗浪劳牢老姥勒乐雷磊累儡垒类泪冷梨黎离漓理李里鲤礼荔吏栗丽历利例立沥力联莲连廉怜涟帘脸恋炼练粮凉梁良两量亮撩聊僚疗寥了料列烈劣猎琳林临邻鳞凛吝零龄凌灵陵岭领令溜榴留刘流柳六龙聋隆陇楼漏陋卢炉鲁麓露路鹿禄录陆驴吕侣旅履缕律率绿峦乱略轮伦沦纶论萝螺罗落洛络妈麻马埋买麦卖满漫芒茫盲茅毛卯茂帽貌贸枚梅没眉每美昧寐妹媚门闷萌蒙盟猛梦孟靡迷弥米秘觅密棉眠绵冕免勉缅面苗描渺庙妙灭民敏明鸣铭名命摸摹模磨摩魔末莫墨默沫漠陌谋拇母墓暮幕募慕木目睦牧穆那娜纳乃耐奈南男难囊恼馁内嫩能霓倪尼你匿腻逆溺拈年捻念娘鸟凝宁牛浓农弄奴努怒女暖欧鸥偶怕拍排徘派攀潘盘盼畔判叛旁抛袍泡裴陪配佩沛盆烹彭蓬朋鹏捧批披劈苂疲皮僻譬篇偏片飘漂票频贫品聘萍平瓶评屏坡泼颇婆破魄迫剖铺仆莆菩蒲普浦谱期欺栖戚妻七凄其棋奇歧畦崎齐旗祈骑起岂乞企启契砌器气弃泣恰洽铅千迁谦乾黔钱前潜遣浅谴堑嵌欠墙蔷强敲悄桥乔侨巧翘切且钦侵亲秦琴勤禽寝青轻倾卿清擎晴情顷请庆穷秋丘球求囚趋区曲屈驱渠华取趣去权泉全拳犬券缺却鹊雀群然燃冉染壤让饶绕惹热壬仁人忍任刃妊仍日戎蓉荣融容绒柔肉茹儒孺如辱乳汝入软阮瑞锐闰润若弱萨塞赛三散桑丧骚扫瑟色森僧莎砂杀沙纱煞珊杉山删衫闪擅膳善扇伤商赏上尚裳梢捎稍烧芍勺少邵绍赊蛇舌舍赦射慑涉社设申伸身深绅神沈甚肾慎渗声生甥升绳省盛剩胜圣师失施诗尸十石拾时什食实识史矢使驶始式示士世事誓逝势是嗜适仕侍释饰氏市恃室视试收手首守寿授售受瘦兽枢殊抒输叔舒疏书赎孰熟暑曙署蜀黍鼠属术述树束庶数恕衰帅拴霜双爽谁水睡税瞬顺舜说硕朔斯思私司丝死肆寺四伺似巳松颂送宋讼诵搜擞苏酥俗素速粟溯宿诉肃酸算虽隋随绥髓碎岁穗遂隧孙损笋缩索所塌他它塔踏苔台泰太贪潭谭谈坦袒探炭汤塘堂棠唐倘趟涛滔桃逃陶讨特藤腾锑提题蹄啼体替涕天填田恬挑条眺帖听汀廷亭庭挺通桐同铜童统痛偷投头透秃突图徒途涂屠土吐兔湍团推颓蜕退吞拖托脱陀驮驼拓唾娃瓦外湾玩顽丸完挽晚皖宛婉万汪王亡枉网往旺望忘妄威巍微危违围唯惟为维苇萎委尾纬未蔚味畏魏位谓尉慰卫温文闻稳问翁我卧握乌屋无梧吾吴毋武五午舞伍戊雾晤物勿悟误昔熙西吸锡蠋稀息希悉夕惜溪席习喜洗系戏细虾匣霞暇峡侠狭下厦夏先仙鲜纤咸贤衔闲弦嫌显险现献县羡宪陷限线相香箱襄湘乡翔祥详想响享巷像向象萧霄削哮销消宵晓小孝校肖啸笑效些歇蝎鞋协挟携邪斜谐写懈谢屑薪欣辛新忻心信星兴刑型形邢行醒幸杏性姓兄凶胸匈雄熊休修羞朽秀袖绣戌虚须徐许蓄叙旭序畜绪续轩宣悬旋玄选眩绚薛学穴雪血勋熏循旬询寻驯巡训迅押鸭呀牙崖衙涯雅亚讶焉咽烟淹严研岩延言颜炎沿奄掩眼演燕雁彦宴谚央秧杨扬羊洋阳仰痒养漾邀腰妖瑶摇尧遥谣姚药要耀耶爷野冶也页业叶曳夜液一壹医揖依伊衣颐夷遗移仪疑沂宜倚已乙矣以艺抑易邑亿逸亦意毅忆义益溢议谊译异翼荫因殷音阴姻吟银淫寅饮尹引隐印英樱鹰应缨莹营迎赢盈影映庸咏泳涌永用幽优悠忧尤由犹游酉有友右佑又幼迂于榆虞愚余俞逾鱼渔隅予娱雨与禹宇语羽玉域郁吁遇喻峪御愈欲狱育誉浴寓裕预豫鸳渊冤元袁原援园员圆猿源缘远苑愿怨院曰约越跃岳粤月悦阅云匀允运蕴孕匝栽哉灾宰载再在攒赞葬遭藻早蚤躁造燥责择则泽贼怎增憎曾赠扎乍诈摘斋宅窄瞻沾盏斩展战湛章彰漳张掌杖丈帐仗障招昭沼赵照兆召遮折哲辙者蔗浙珍斟真贞针枕震振镇阵蒸征争整拯正政郑证芝枝支蜘知肢脂之职直植执值指止只纸志挚至致置峙制智秩质滞治中忠钟终种肿重仲众舟周州洲轴咒宙骤珠蛛朱诸诛逐竹烛煮主著柱助铸筑讬住注";
	
	public static void main(String[] args) throws IOException {
		File file=new File("C:\\Users\\neusoft\\Desktop\\text.txt");
		FileWriter writer=new FileWriter(file);
		
		for (int i = 1; i <= 1000000; i++) {
			
			Random random=new Random();
			
			int x=random.nextInt(word.length());
			
			writer.write(word.charAt(x));
			System.out.println(word.charAt(x));
			
			if(i%87==0){
				writer.write(",\r\n");
			}
			
			if(i%300==0){
				writer.write("。\r\n");
				System.out.println("。\r\n");
			}
			
		}
		
		writer.write("。");
		writer.close();
	}

}
